Revit 2027 API
MEPNetworkSegmentData(MEPNetworkSegmentData) Constructor
 Creates a new segment data object based on another object.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPNetworkSegmentData(
	MEPNetworkSegmentData other
)
Public Sub New (
	other As MEPNetworkSegmentData
)
public:
MEPNetworkSegmentData(
	MEPNetworkSegmentData^ other
)
new :
        other : MEPNetworkSegmentData -> MEPNetworkSegmentData
Parameters
other MEPNetworkSegmentData
 The other segment data that the new object is based on.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MEPNetworkSegmentData Class
MEPNetworkSegmentData Overload
Autodesk.Revit.DB.Analysis Namespace